def data():
    return f"{input('Введите фамилию: ')} {input('Введите имя: ')} {input('Введите класс: ')}\n"

def operation():
    return input('Добро пожаловать в эту школу. Тут вы можете получить конкретную информацию. Выберите нужную категорию по списке\n \
    1-Вывод всех фамилии в этой школе\n \
    2-Вывод всех имен в этой школе\n \
    3-Вывод всех № классов в этой школе\n \
    4-Вывод учеников выбранного класса\n \
    5-Вывод всю таблицу\n \
    6-Вывод информации по ученику\n \
    7-Ввод ученика в эту школу\n \
    8-Завершить работу\n ')