# 3.Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# *Пример:*

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


import os
os.system('cls||clear')

print('Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.\n')

from random import uniform

n = int(float(input('Введите количество элементов n: ')))

list = [round(uniform(0,9),2) for i in range(n)]
print(f'\nРандомный список вещественных чисел: {list}')

min = min(list, key=lambda i: float(i))
max = max(list, key=lambda i: float(i))

dif = (max - int(max)) - (min - int(min))

print(f'\nВ списке нашли максимум: {max} и минимум: {min}')
print(f'\nРазница между макс и мин дробной части:', round(dif,2))
print(f'\n')
