# Урок 1. Знакомство с Python
# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

import os
os.system('cls||clear')

print('Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.\n')
x1 = float(input('\nВведите x1: '))
y1 = float(input('\nВведите y1: '))
x2 = float(input('\nВведите x2: '))
y2 = float(input('\nВведите y2: '))

import math 
length = round(math.sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2), 2)
print(f'\nРасстояние между ними в 2D пространстве равно(c округлением): {length}\n' )
